// js працює завжди в якомусь оточенні що дає нам свій функціонал
console.log("hi");

// цей таймаут виконується і пропадає зі стека а потім в стек закидується лог з таймаута
// setTimeout йде в web api
// event loop  констркуція яка дивиться що є в web api
setTimeout(() => {
    console.log("Timeout");
}, 1000);

// callback queue чекає поки в call stack виконається весь код і тільки тоді викидує  колбеки
// стек противоположне до черги 
// черга - перший прийщов перший вийшов
console.log("bye");
