// вихідний код -> парсер -> інтерпритатор->компілятор->машинний код
// jit компілятор він бере дещо від компілятора і привносить в інтерпритатор
// bite code середнє між машинним комдом і тим що ми пишемо
// інтерпритатор під час виконання нашої програми збирає інфу як ми використовуємо програму
// гарячі ф-ї ті які ми часто юзаємо
// під час виконання програми може виконуватися деоптимізація якщо наприклад ф-я викликалася з числами а потім зі строками
// jit компілятори пришвидшують інтерпритацію





