// робить запрос на сервер
// якщо ф-я асинхронна колбек передається останнім аргументром
function getuserData(id, cb) {
    fetch(id)
    // логіка якась
    // cb(new Error()) якщо помилка

    // якщо все ок
    cb(null, {})
}
// спочатку передаємо помилку в колбек
getuserData('id', (err, result) => {
    if (err) {
        // обробка
        err.message
    }


})

/*
мінуси
-вложеність
-лишній код
-не зрозуміло чи то асинхронна дія чи ні тобто не можна зрозуміти в якій послідовності буде виконуватися код
проблема довіри - ми передаємо контроль над кодом комусь - тому що хтось може виконати ф-ю пізніше раніще або не виконати

*/
// колбек хелл
getuserData((err, result) => {
    if (err) { throw err }
    getFriendsById(result.id, (err, result) => {
        if (err) {
            throw err;
        }
        getPhotos(result[0].id, (err, result) => {
            if (err) {
                throw err
            }
            //.....
        })
    })
})